In [5]:
import pandas as pd
import numpy as np

In [6]:
stuff = {
    'Corporation': ['Apple','Google','Meta','Apple','Google','Meta'],
    'Employess' : ['john','Matt','Joe','Jeff','Justin','Seff'],
    'Salary' : [200,230,500,600,570,600]
}

data = pd.DataFrame(stuff)
data

  Corporation Employess  Salary
0       Apple      john     200
1      Google      Matt     230
2        Meta       Joe     500
3       Apple      Jeff     600
4      Google    Justin     570
5        Meta      Seff     600

In [7]:
### Create a function
def times1000(x):
     return x * 1000

In [8]:
#### Apply function
data['Salary'].apply(times1000)

0    200000
1    230000
2    500000
3    600000
4    570000
5    600000
Name: Salary, dtype: int64

In [9]:
#### Make it into a dataframe
pd.DataFrame(data['Salary'].apply(times1000))

   Salary
0  200000
1  230000
2  500000
3  600000
4  570000
5  600000

In [10]:
### Add last name
def namer(x):
    if x == "john":
        return "John D'souza"
    else:
        return x

In [11]:
data['Employess'].apply(namer)

0    John D'souza
1            Matt
2             Joe
3            Jeff
4          Justin
5            Seff
Name: Employess, dtype: object

In [12]:
### Convert it into dataframe
pd.DataFrame(data['Employess'].apply(namer))

      Employess
0  John D'souza
1          Matt
2           Joe
3          Jeff
4        Justin
5          Seff

In [14]:
### Use lambda

pd.DataFrame(data["Salary"].apply(lambda x : x * 1000))

   Salary
0  200000
1  230000
2  500000
3  600000
4  570000
5  600000